# 15:35 ~
#
# 규칙 : 전 단계 0 / 9는 2개가 파생되지 않고 1나만 파생된다
#
# 1 => 1 2 3 4 5 6 7 8 9 
# 2 => 10, 12, 21, 23, 32, 34, 43, 45, 54, 56, 65, 67, 76, 78, 87, 89, 
#       98
#       => *2를 하고 -2를 해준다 (양쪽 0, 9)
# 3 => 101, 121, 123, 212, 210 232 234 321 324 ..... 765, 767, 787, 789, 896, 898, 897      -> 2
# 4 => 1010, 1012, 1210, 1212, 1232, 1234         ....  7876 7878 7898 8967 8965 8988 8989  -> 4
#                                                    789  8989           8989


n = int(input())
dp = [0]*(n+1)

dp[0] = 9
dp[1] = 17

for a in range(2, n):
    dp[a] = dp[a-1]*2 - 2*(a)

print(int(dp[n-1]%1e9))

#####


n = int(input())
dp = [[] for _ in range(n+1)]

# 1,2,3,4,5,6,7,8,9
dp[0] = [a for a in range(1, 10)]

for a in range(1, n):
    for b in range(len(dp[a-1])):
        if dp[a-1][b] == 0:
            dp[a].append(1)
        elif dp[a-1][b] == 9:
            dp[a].append(8)
        else:
            dp[a].append(dp[a-1][b]-1)
            dp[a].append(dp[a-1][b]+1)
            
print(len(dp[n-1]))